#برنامه ای بنویسید که ۲۰ عدد از ورودی بخواند و در انتها عددی که بیشترین تعداد مقسوم علیه را دارد به همراه تعداد مقسوم علیه‌‌‌‌‌‌‌‌‌‌‌‌های آن در خروجی چاپ کند. اگر چند عدد این حالت را داشتند بزرگترین آنها را چاپ کند.
#یکی از هدف های سوالات از این به بعد استفاده از تابع می باشد. هر جا احساس کردید می توانید قسمتی از کد را به صورت یک تابع جداگانه بنویسید این کار را انجام دهید. برای این سوال تابعی بنویسید که یک عدد به عنوان ورودی دریافت کند و تعداد مقسوم علیه های آن عدد را در خروجی چاپ کند. سپس در برنامه ی خود از این تابع استفاده کنید.
answer = 0
temp_1 =0
count = 0
for i in range(20):
    number = int(input(''))
    for x in range(1, number+1):
        if number % x == 0:
            temp_1+=1
    if temp_1 > count:
        count = temp_1
        answer = number
    elif temp_1 == count:
        if(number > answer):
            answer = number
            count = temp_1
    temp_1 = 0
print(answer, count)