#در این برنامه امتیازی که تیم سپیدرود رشت در مسابقات لیگ برتر فوتبال کسب کرده را به عنوان ورودی دریافت کنید و جمع امتیازات سپیدرود رشت به همراه تعداد بردهای این تیم در این فصل را در خروجی چاپ کنید. سپیدرود در لیگ برتر ۳۰ بازی انجام میدهد پس در ۳۰ خط امتیازات این تیم به شما داده می شود. به ازای هر بازی تیم سپیدرود یا صفر امتیاز کسب کرده یا یک و یا سه امتیاز. این تیم در صورت باخت صفر امتیاز، در صورت تساوی یک امتیاز و در صورت برد سه امتیاز کسب می کند.
jam =0 
win =0
draw =0
loss =0
kol =0
while kol != 30:
        amtiaz = (int (input ()))
        if amtiaz == 3 :
            jam = jam + 3
            win = win + 1
            kol = kol + 1
        elif amtiaz == 1 :
            jam = jam + 1
            draw = draw + 1
            kol = kol + 1
        elif amtiaz == 0 :
            loss = loss +1
            kol = kol +1
print ( jam , win )