#مسئولین فدراسیون کبدی کشور در حال آماده سازی تیم هایی برای شرکت در مسابقات جهانی کبدی هستند. طبق قوانین مسابقات جهانی کبدی هر شخص فقط در ۵ مسابقه ی جهانی کبدی می تواند شرکت کند. رئیس فدراسیون تمامی ورزشکاران این رشته را دور هم جمع کرده است، هر بازیکن تا امروز تعدادی بار در مسابقات جهانی شرکت کرده است. تیم های کبدی دقیقا از ۳ نفر تشکیل می شود. حال آقای شایگان آریامهر، رئیس فدراسیون می خواهد تیم هایی تشکیل دهد که در صورت انتخاب شدن هرکدام از آن تیم ها، حداقل بتوانند 3 سال با هم در مسابقات جهانی شرکت کنند (یعنی هرکدام از اعضای یک تیم حداکثر ۲بار در مسابقات جهانی شرکت کرده باشند)
#خط اول ورودی شامل عدد n یعنی تعداد بازیکنان کبدی مد نظر است. خط بعدی ورودی شامل n عدد که با space از هم جدا شده اند می باشد که نمایانگر این است که هر بازیکن چندبار در مسابقات جهانی شرکت کرده است. در خروجی یک عدد چاپ کنید که نمایانگر حداکثر تیم های تشکیل شده با شرایط گفته شده می باشد.
tedad = input()
sab = input('')
vaj = 0
li = sab.split(' ') 
for i in range(0,len(li)):
    if li[i] =='0':
        vaj = vaj+1
    elif li[i] == '1':
        vaj = vaj+1
    elif li[i] == '2':
        vaj = vaj+1
print(int(vaj/3))