#مراحل بازی به این ترتیب می باشد:
#ابتدا کاربر  یک عدد را در ذهن خود مشخص می کند و به کامپیوتر این عدد را نمی گوید (به عنوان ورودی به کامپیوتر عدد را نمی دهد)(عددی بین ۱ تا ۹۹)
#برنامه را اجرا می کنیم
#برنامه یک عدد را حدس زده و چاپ می کند 
#عدد چاپ شده سه حالت را  ایجاد می کند
#۱-یا از عددی که شما در ذهن خود دارید بزرگتر هست که شما با تایپ حرف k به برنامه می گویید که عدد در ذهن شما از عددی که برنامه چاپ کرده کوچکتر است و برنامه باید عدد دیگری را حدس زده و نمایش بدهد و ... (قابل ذکر است که در این حالت با تایپ k برنامه باید عدد کوچکتری از حدس قبلی خود حدس بزند تا بازی زودتر تمام شود)
#۲-و یا اینکه عدد چاپ شده از از عددی که شما در ذهن خود دارید کوچکتر هست که با تاپ حرف b به برنامه می گویید که عدد در ذهن شما از عددی که برنامه چاپ کرده بزرگتر  است و برنامه باید عدد دیگری را حدس زده و نمایش بدهد و ... (قابل ذکر است که در این حالت با تایپ b برنامه باید عدد بزرگتری از حدس قبلی خود حدس بزند تا بازی زودتر تمام شود)
#۳- و یا اینکه عدد چاپ شده همان عددی است که در ذهن شما بود و با تایپ حرف d به برنامه می گویید که درست حدس زده و برنامه تمام می شود
import random
a = 1
c = 99
hads = random.randint(a , c )
print ( hads )
javab = (str (input ("aia doroste ? : ")))
while javab != 'd':
    if javab == 'b':
        a = hads+1
    elif javab == 'k':
        c = hads-1
    hads = random.randint(a , c )    
    print ( hads )
    javab = (str (input ("aia doroste ? : ")))
