#آریامنش (اسم پسر داریوش هم بوده) خیلی ناراحته که توی اینترنت ملت وقتی یه کلمه می نویسن توش هم حروف بزرگ استفاده می کنن هم حروف کوچیک. به خاطر همین تصمیم گرفت یه browser بنویسه که کلماتی که هم حروف کوچیک دارن هم حروف بزرگ رو به صورت جدیدی بنویسه، به این صورت که اگر کلمه ای تعداد حروف بزرگش از تعداد حروف کوچیکش بیشتر بود کل کلمه رو با حروف بزرگ می نویسه در غیر این صورت کل کلمه رو با حروف کوچیک می نویسه.
txt = input ()
tool = len(txt)
boz = 0
nsftool = float(tool / 2)
for i in txt :
    if i == i.upper() :
        boz = boz +1
if boz > nsftool:
    txt=txt.upper()
else:
    txt=txt.lower()
print(txt)