#برنامه ای بنویسید که چند عدد مثبت را از ورودی بخواند و ریشه ی دوم آن را تا ۴ رقم اعشار چاپ کند.
#خط اول ورودی عدد n را نشان می دهد که تعداد عددهایی است که باید ریشه ی دوم آنها را محاسبه کنید. هر یک از n خط بعدی شامل یک عدد مثبت است. برای اطلاعات بیشتر به نمونه های ورودی و خروجی توجه کنید. راهنمایی : در این تمرین باید از کتابخانه ی math و تابع sqrt از آن کتابخانه استفاده کنید.
#لطفا توجه کنید که به هیچ وجه نباید خروجی round شود. دقیقا ۴ رقم بعد از اعشار را چاپ کنید.
import math

n = int(input())

result = []

for i in range(1, n + 1):
    number = int(input())
    radical = math.sqrt(number)
    result.append(radical)



for j in result:
    eight = (f'{j:.8f}')
    four = eight[:-4]
    print(four)